{
  "intro": {
    "title": "Phishing - everything you need to know",
    "text": "Phishing is one of the most common methods of online fraud. It involves impersonating trusted institutions or individuals in order to obtain confidential data (e.g., logins, passwords, card numbers) or to persuade the victim to perform a specific action, such as clicking on a dangerous link or downloading a malicious file."
  },
  "whatIsPhishing": {
    "title": "What is phishing?",
    "text": "The attacker creates a fake but very credible-looking message, website, or form. Most often, it imitates communication with a bank, courier, or social media platform. The goal is to trick the recipient into revealing confidential login data or clicking on a malicious link that leads to a data-phishing site or installs malware."
  },
  "types": {
    "title": "Types of phishing",
    "email": {
      "subtitle": "Email phishing",
      "text": "The most common form, where the victim receives an email that appears to be sent by a bank, government office, or online store. The message contains a link or attachment that is risky to open."
    },
    "smishing": {
      "subtitle": "Smishing",
      "text": "A variant of phishing that uses SMS messages. The victim receives a message about an alleged package, payment, or account block, along with a link to a fake website."
    },
    "vishing": {
      "subtitle": "Vishing",
      "text": "Phishing through phone calls. The fraudster impersonates a bank employee or other institution employee, trying to extract data or convince the victim to make a transfer."
    },
    "spear": {
      "subtitle": "Spear phishing",
      "text": "This is a more advanced form of phishing, where the fraudster gathers information about their victim, e.g., from social media, to create a personalized and therefore more credible message."
    }
  },
  "howToRecognize": {
    "title": "How to recognize an attack?",
    "text": "Typical warning signs include language errors, unusual sender address, time pressure, requests for urgent action, and links leading to suspicious domains. It's always worth hovering over a link to check where it actually leads."
  },
  "shortSteps": {
    "title": "What to do — short steps",
    "steps": [
      "Don't click on links and don't reply to suspicious messages.",
      "Carefully check the sender's address and the domain from which the message came.",
      "Report the incident to the IT department or appropriate authorities.",
      "If you clicked a link or provided data — immediately change your password and enable two-factor authentication (2FA)."
    ]
  },
  "consequences": {
    "title": "Consequences of phishing",
    "subtitle": "Loss of login data or account access can lead to:",
    "steps": [
      "Theft of financial funds from bank account",
      "Takeover of email inbox and using it for further attacks",
      "Leak of confidential company information",
      "Impersonating the victim to deceive their friends or colleagues"
    ],
    "note": "Even one click on a malicious link can have serious consequences both for a private person and for an entire organization."
  },
  "protection": {
    "title": "How to effectively protect yourself?",
    "steps": [
      "Always use strong, unique passwords and a password manager",
      "Enable two-factor authentication (2FA) wherever possible",
      "Regularly update your system and applications to remove security vulnerabilities",
      "Stay alert to suspicious messages and never share your login data"
    ],
    "note": "Awareness and caution are the best protection against phishing."
  },
  "statistics": {
    "title": "Statistics and facts",
    "steps": [
      "According to research, over 70% of all cyber attacks start with phishing.",
      "Hundreds of millions of fake emails are sent worldwide every day.",
      "As many as 1 in 5 people admit that they have clicked on a suspicious link at least once",
      "Phishing is increasingly conducted in a personalized way, making messages look very credible.",
      "People in a hurry are most often victims — lack of time to check details favors mistakes."
    ],
    "note": "Awareness of the scale of the problem helps understand why caution and simple security habits can protect us from serious losses."
  },
  "ifVictim": {
    "title": "What to do if you become a victim of phishing?",
    "subtitle": "If you suspect that you clicked on a suspicious link, provided data, or downloaded a file:",
    "steps": [
      "Immediately change the password for the account that was targeted by the attack (and if you use the same password elsewhere, change it there too)",
      "Enable two-factor authentication (2FA) if available — it's an additional layer of protection.",
      "Notify your bank or service operator — block the possibility of unauthorized transactions.",
      "Report the incident to the IT department or appropriate authorities — quick response can protect other users.",
      "Scan your computer or phone with current antivirus software to make sure no malicious software has been installed.",
      "Monitor your accounts and transactions — pay attention to unusual logins, messages, and financial operations."
    ],
    "note": "The faster you react, the smaller the potential consequences of the attack will be."
  },
  "bestPractices": {
    "title": "Good daily practices",
    "subtitle": "To reduce the risk of becoming a phishing victim on a daily basis, it's worth developing some simple habits:",
    "steps": [
      "Always check the sender's address — even if the message looks familiar, make sure it comes from a real domain.",
      "Don't click on links in a hurry — stop for a moment and verify where the link leads.",
      "Use a password manager — this way you won't enter data on fake sites, because the manager will recognize the incorrect domain.",
      "Enable 2FA (two-factor authentication) — even if someone learns your password, access to the account will be difficult.",
      "Regularly update your system and applications — most attacks exploit vulnerabilities in outdated software.",
      "Maintain healthy skepticism — any message that is too urgent, too attractive, or unusual should raise your alertness."
    ],
    "note": "Conscious internet use and caution in daily activities is the best protection against fraudsters."
  },
  "examples": {
    "title": "Phishing examples",
    "email": {
      "title": "Fake email",
      "message": "From: info@bank-example.com Subject: Urgent! Your account has been blocked ---------------------------------------------- Dear Customer, We have noticed suspicious activity. Click immediately: http://bank-example.verify-user.xyz/login Best regards, Bank Example",
      "flags": [
        "🔴 Sender: domain is not a real bank",
        "🔴 Link: strange URL address",
        "🔴 Tone: pressure and urgency"
      ]
    },
    "sms": {
      "title": "SMS (smishing)",
      "message": "Your package is waiting for payment. Click: http://fake-dhl-track.info",
      "flags": [
        "🔴 Link looks corporate, but the domain is suspicious",
        "🔴 No personalization — message generated en masse"
      ]
    }
  }
}